vlm/base/Documents/бит_ПланОтгрузок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ПланОтгрузок</Name>
			<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_ПланыОтгрузок</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>бит_НачалоПериода</Name>
					<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_КонецПериода</Name>
					<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Ответственный</Name>
					<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Автор</Name>
					<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Организация</Name>
					<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>бит_Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>бит_ДатаОтгрузки</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_НомерЗаказаКлиента</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_НомерЗаказаНаПроизводство</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство2_2</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_СрокИсполнения</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_Клиент</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОтправительПолучательТоваров</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_Номенклатура</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_КОтгрузке</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_ФактическиОтгружено</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_Откл</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_Недогрузка</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_Перегрузка</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_ОсновнойМенеджер</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_Комментарий</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_МассаНетто</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_КодСтроки</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_СрокИзготовления</Name>
							<Comment>исправление после сквозного</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/base/AccumulationRegisters/бит_ПланыОтгрузок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бит_ПланыОтгрузок</Name>
			<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>бит_МассаНетто</Name>
					<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ФактОтгрузки</Name>
					<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_Недогруз</Name>
					<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_Перегруз</Name>
					<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>бит_ОсновнойМенеджер</Name>
					<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Комментарий</Name>
					<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>бит_Номенклатура</Name>
					<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>бит_Клиент</Name>
					<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтправительПолучательТоваров</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>бит_ДатаОтгрузки</Name>
					<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>бит_НомерЗаказаКлиента</Name>
					<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>бит_НомерЗаказаНаПроизводство</Name>
					<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство2_2</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>бит_КодСтроки</Name>
					<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>бит_СрокИзготовления</Name>
					<Comment>исправление после сквозного</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

vlm/base/Documents/бит_ПланОтгрузок/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    // Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	Если  РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ПланОтгрузок.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.бит_ПланОтгрузок КАК бит_ПланОтгрузок
		|ГДЕ
		|	бит_ПланОтгрузок.бит_НачалоПериода >= &НачалоПериода
		|	И бит_ПланОтгрузок.бит_КонецПериода <= &КонецПериода
		|	И бит_ПланОтгрузок.ПометкаУдаления = ЛОЖЬ
		|	И бит_ПланОтгрузок.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("КонецПериода", бит_КонецПериода);
		Запрос.УстановитьПараметр("НачалоПериода", бит_НачалоПериода);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать(); 
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Ссылка) Тогда
				Если Выборка.Ссылка <> Ссылка Тогда
					Отказ = Истина;
					ТекстСообщения = "За указанный период уже существует план отгрузок!";
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);	
				КонецЕсли;
			Иначе
				Отказ = Истина;
				ТекстСообщения = "Документ за указанный период невозможно создать!";
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;	
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
 КонецПроцедуры  
 
 Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	 
	Движения.бит_ПланыОтгрузок.Записывать = Истина;
	Для Каждого ТекСтрокабит_Товары Из бит_Товары Цикл
		Движение = Движения.бит_ПланыОтгрузок.Добавить();
		Движение.Период = Дата;
		Движение.бит_Номенклатура = ТекСтрокабит_Товары.бит_Номенклатура;
		Движение.бит_Клиент = ТекСтрокабит_Товары.бит_Клиент;
		Движение.бит_ДатаОтгрузки = ТекСтрокабит_Товары.бит_ДатаОтгрузки;
		Движение.бит_СрокИзготовления = ТекСтрокабит_Товары.бит_СрокИзготовления; // исправление после сквозного
		Движение.бит_НомерЗаказаКлиента = ТекСтрокабит_Товары.бит_НомерЗаказаКлиента;
		Движение.бит_НомерЗаказаНаПроизводство = ТекСтрокабит_Товары.бит_НомерЗаказаНаПроизводство;
		Если ЗначениеЗаполнено(ТекСтрокабит_Товары.бит_МассаНетто) Тогда
			Движение.бит_МассаНетто = ТекСтрокабит_Товары.бит_МассаНетто;
		Иначе Движение.бит_МассаНетто = 0;
		КонецЕсли; 
		Если ЗначениеЗаполнено(ТекСтрокабит_Товары.бит_ФактическиОтгружено) Тогда
			Движение.бит_ФактОтгрузки = ТекСтрокабит_Товары.бит_ФактическиОтгружено;
		Иначе Движение.бит_ФактОтгрузки = 0;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокабит_Товары.бит_Перегрузка) Тогда
			Движение.бит_Перегруз = ТекСтрокабит_Товары.бит_Перегрузка;
		Иначе Движение.бит_Перегруз = 0;
		КонецЕсли;
        Если ЗначениеЗаполнено(ТекСтрокабит_Товары.бит_Недогрузка) Тогда
			Движение.бит_Недогруз = ТекСтрокабит_Товары.бит_Недогрузка;
		Иначе Движение.бит_Недогруз = 0;
		КонецЕсли;
        Движение.бит_ОсновнойМенеджер = ТекСтрокабит_Товары.бит_ОсновнойМенеджер;
		Движение.бит_Комментарий = ТекСтрокабит_Товары.бит_Комментарий;  
		Движение.бит_КодСтроки = ТекСтрокабит_Товары.бит_КодСтроки;
	КонецЦикла;

КонецПроцедуры  
#КонецОбласти
